{
  "translation": {
    "english": "English",
    "french": "Français",
    "arabic": "العربية",
    "russian": "Русский",
    "github_code": "Код проекта",
    "toggle_color_scheme": "Переключить цветовую тему",
    "tasks_list": "Задачи",
    "task_number": "Задача {{task}}",
    "open_tasks_list": "Открыть список задач",
    "show_tables_structure": "Показать таблицы данных",
    "amount_of_tables": "Количество таблиц",
    "sql_textarea_label": "Поле ввода для вашего SQL-запроса",
    "sql_textarea_placeholder": "Введите SQL-запрос...",
    "show_expected_result": "Показать ожидаемый результат",
    "check_answer": "Ответить",
    "next_task": "Далее",
    "error_info": "Информация об ошибке",
    "tables_description": "Таблицы данных",
    "column_property": "Свойство колонки",
    "primary_key": "Первичный ключ",
    "foreign_key_to": "Внешний ключ к",
    "foreign_key_to_table": "Таблице",
    "foreign_key_to_column": "Колонке",
    "outputs": "Результаты",
    "your_outputs": "Ваш результат",
    "here_will_be_your_output": "Тут появится результат вашего запроса",
    "expected_output": "Ожидаемый результат",
    "no_expected_output_for_task": "Для этого задания нет ожидаемого результата",
    "correct_answer": "Правильный запрос",
    "incorrect_answer": "Неверный запрос",
    "topics": {
      "select": "SELECT",
      "groupBy": "GROUP BY",
      "join": "JOIN",
      "subquery": "ПОДЗАПРОСЫ",
      "cte": "CTE (Обобщенные табличные выражения)",
      "window": "ОКОННЫЕ ФУНКЦИИ",
      "aggregate": "ПРОДВИНУТЫЕ АГРЕГАЦИИ",
      "advanced": "ПРОДВИНУТЫЙ SQL"
    },
    "tasks": {
      "select_all_invoices": "Получите список всех накладных (таблица invoices) со всеми атрибутами.",
      "select_all_artists": "Получите список всех исполнителей (таблица artists) со всеми атрибутами.",
      "select_all_artists_names": "Получите список имён всех исполнителей (таблица artists).",
      "select_first_and_last_name_of_employees": "Получите имена и фамилии всех сотрудников (таблица employees).",
      "select_employees_sorted_by_hire_date_desc": "Получите список всех сотрудников (таблица employees) со всеми атрибутами. Отсортируйте список по дате найма (колонка hire_date) в порядке убывания.",
      "select_first_and_last_name_of_employees_sorted_by_hire_date_asc": "Получите имена и фамилии всех сотрудников (таблица employees). Отсортируйте список по дате найма (колонка hire_date) в порядке возрастания.",
      "select_names_and_length_of_tracks_sorted_by_names_and_milliseconds": "Получите названия (колонка name) и длительности (колонка milliseconds) музыкальных композиций. Отсортируйте список по названию композиции в алфавитном порядке. Если две композиции имеют одинаковое название — отсортируйте их по длительности в порядке убывания.",
      "select_employees_title_support_agent": "Получите имена и фамилии всех сотрудников (таблица employees), которые состоят на должности Sales Support Agent (колонка title).",
      "select_tracks_bigger_than_100000000_bytes": "Получите названия музыкальных композиций (колонка name), чей размер (колонка bytes) превышает 100000000 байт.",
      "select_tracks_smaller_than_500000_bytes": "Получите названия музыкальных композиций (колонка name), чей размер (колонка bytes) составляет менее 500000 байт.",
      "select_tracks_between_500000_and_5000000_bytes": "Получите названия музыкальных композиций (колонка name), чей размер (колонка bytes) находится между 500000 и 5000000 байт включительно.",
      "select_employees_before_15_feb_2011": "Получите даты найма, имена и фамилии всех сотрудников (таблица employees), которые были наняты до 15 февраля 2011 года.",
      "select_employees_last_names_starting_with_A": "Получите список всех сотрудников (таблица employees) со всеми атрибутами, чьи фамилии начинаются с латинской заглавной буквы A.",
      "select_employees_first_names_ending_with_a": "Получите список всех сотрудников (таблица employees) со всеми атрибутами, чьи имена заканчиваются на латинскую строчную букву a.",
      "select_employees_with_address_contains_Ave": "Получите список всех сотрудников (таблица employees) со всеми атрибутами, чьи адреса содержат текст Ave.",
      "select_invoices_from_canada_ab": "Получите список всех накладных (таблица invoices) со всеми атрибутами, где страной оплаты (колонка billing_country) является Canada и штатом оплаты (колонка billing_state) является AB.",
      "select_invoices_from_nv_reno_with_total_more_than_5": "Получите список всех накладных (таблица invoices) со всеми атрибутами, где штатом оплаты (колонка billing_state) является NV, городом оплаты (колонка billing_city) является Reno и сумма оплаты (колонка total) превышает $5.",
      "select_invoices_from_states_nv_or_ab": "Получите список всех накладных (таблица invoices) со всеми атрибутами, где штатом оплаты (колонка billing_state) является NV или AB.",
      "select_tracks_without_composer": "Получите список всех музыкальных композиций (таблица tracks) со всеми атрибутами, для которых не указан композитор.",
      "select_customers_with_company": "Получите список всех покупателей (таблица customers) со всеми атрибутами, для которых указана компания.",
      "select_invoices_germany_ordered_total_desc_limit_3": "Получите топ-3 накладных (таблица invoices) по сумме заказа (колонка total). В топ-3 должны попасть только те накладные, чьей страной оплаты является Germany. Получите все атрибуты каждой накладной.",
      "select_billing_address_invoices_ca_cupertino_ordered_total_desc_limit_3": "Получите топ-3 накладных (таблица invoices) по сумме заказа (колонка total). В топ-3 должны попасть только те накладные, чьим штатом оплаты (колонка billing_state) является CA и городом оплаты (таблица billing_city) является Cupertino. Для каждой накладной из топ-3 выведите только платежный адрес (колонка billing_address).",
      "select_id_invoices_ca_cupertino_or_mountain_view": "Получите ID накладной (таблица invoices) с самой маленькой суммой (колонка total), чьим штатом оплаты (колонка billing_state) является CA, а городом оплаты (колонка billing_city) является Mountain View или Cupertino.",
      "count_customers_by_country": "Получите список стран и количество покупателей в каждой из стран. Используйте только таблицу customers и колонку country.",
      "count_tracks_by_unit_price": "Получите список цен на музыкальные композиции и количество композиций каждой стоимости. Используйте только таблицу tracks и колонку unit_price.",
      "count_tracks_by_unit_price_ordered_asc": "Как и в прошлой задаче, получите список цен на музыкальные композиции и количество композиций каждой стоимости. Используйте только таблицу tracks и колонку unit_price. Отсортируйте результат по количеству композиций в порядке возрастания.",
      "count_tracks_by_unit_price_ordered_asc_limit_1": "Доработайте запрос из предыдущей задачи таким образом, чтобы он выводил только цену с наименьшим количеством композиций.",
      "join_artists_names_and_album_titles": "Получите список имён исполнителей и названия всех их альбомов.",
      "join_album_titles_and_tracks_titles": "Получите список всех названий альбомов и названий всех музыкальных композиций в этих альбомах.",
      "join_artists_names_and_album_titles_ordered_artists_name_desc": "Получите список имён исполнителей и названия всех их альбомов. Отсортируйте результат по имени исполнителя в обратном алфавитном порядке.",
      "join_customer_name_and_total_ordered_by_total": "Получите список имён и фамилий покупателей и соответствующих им сумм накладных. Отсортируйте результат по сумме накладной.",
      "select_all_aerosmith_albums": "Получите список всех названий альбомов группы Aerosmith.",
      "select_all_albums_with_midnight_track": "Получите список всех названий альбомов, в которых содержится музыкальная композиция с названием Midnight.",
      "select_all_artists_with_midnight_track": "Получите список имён всех исполнителей, у которых есть музыкальная композиция с названием Midnight. Помните, что использовать JOIN можно более одного раза.",
      "count_iron_maiden_albums": "Получите количество альбомов, принадлежащих исполнителю Iron Maiden.",
      "count_each_albums_of_artists": "Получите количество альбомов принадлежащих каждому исполнителю. Отсортируйте исполнителей по ID.",
      "artist_with_max_albums": "Получите исполнителя с самым большим количеством альбомов. Выведите его имя и количество принадлежащих ему альбомов.",
      "select_top5_clients_with_most_sum_of_invoices": "Получите топ-5 покупателей, с наибольшей суммой всех их накладных. Обратите внимание, что для каждого покупателя должна учитываться именно сумма всех его накладных, а не каждая накладная в отдельности.",
      "select_products_above_average_price": "Найдите все продукты с ценой выше средней.",
      "select_customers_with_orders": "Выберите всех клиентов, которые сделали хотя бы один заказ.",
      "select_products_never_ordered": "Найдите продукты, которые никогда не заказывали.",
      "select_most_expensive_product_per_category": "Найдите самый дорогой продукт в каждой категории.",
      "select_customers_above_average_spending": "Выберите клиентов с общими расходами выше среднего.",
      "select_products_with_above_average_reviews": "Найдите продукты со средним рейтингом выше общего среднего.",
      "select_suppliers_with_low_stock_products": "Найдите поставщиков с товарами с низким запасом (< 20 единиц).",
      "cte_total_sales_per_customer": "Используя CTE, рассчитайте общие продажи на клиента.",
      "cte_category_revenue": "Используя CTE, рассчитайте выручку по категориям.",
      "cte_top_customers_by_tier": "Используя CTE, найдите средний чек по уровням лояльности.",
      "cte_multiple_customer_product_stats": "Используя несколько CTE, найдите клиентов с более чем 2 заказами.",
      "cte_recursive_category_hierarchy": "Используя рекурсивный CTE, отобразите полную иерархию категорий.",
      "window_row_number_customers_by_registration": "Присвойте номера строк клиентам по дате регистрации.",
      "window_rank_products_by_price": "Ранжируйте продукты по цене от высокой к низкой.",
      "window_dense_rank_products_by_category": "Ранжируйте продукты внутри каждой категории по цене.",
      "window_running_total_orders": "Рассчитайте текущий итог сумм заказов во времени.",
      "window_moving_average_sales": "Рассчитайте скользящее среднее за 3 периода для сумм заказов.",
      "window_lead_lag_order_comparison": "Сравните каждый заказ с предыдущим и следующим для того же клиента.",
      "window_first_last_value_customer_orders": "Найдите суммы первого и последнего заказа для каждого клиента.",
      "window_ntile_customer_segments": "Разделите клиентов на 4 квартиля по общим расходам.",
      "aggregate_having_clause": "Найдите категории со средней ценой товара более 500.",
      "aggregate_multiple_functions": "Рассчитайте несколько агрегатов для заказов клиентов.",
      "aggregate_group_by_multiple_columns": "Подсчитайте клиентов по стране и уровню лояльности.",
      "aggregate_conditional_count": "Подсчитайте общие заказы и доставленные заказы на клиента.",
      "join_left_outer_customers_orders": "Покажите всех клиентов с количеством их заказов, включая тех, у кого нет заказов.",
      "join_self_find_customers_same_city": "Найдите пары клиентов из одного города.",
      "join_cross_product_combinations": "Создайте комбинации категорий верхнего уровня и поставщиков.",
      "advanced_top_selling_products": "Найдите топ-5 самых продаваемых товаров с деталями категории и выручки.",
      "advanced_customer_lifetime_value": "Рассчитайте метрики пожизненной ценности клиента.",
      "advanced_product_performance_by_supplier": "Проанализируйте производительность продукта по поставщикам.",
      "advanced_monthly_sales_trend": "Покажите ежемесячные тренды продаж с количеством заказов и выручкой.",
      "advanced_customer_retention_analysis": "Проанализируйте удержание клиентов с датами первого/последнего заказа.",
      "advanced_product_review_analysis": "Проанализируйте продукты по рейтингам отзывов и объему продаж.",
      "advanced_category_hierarchy_sales": "Рассчитайте продажи по родительской и дочерней категории.",
      "advanced_discount_impact_analysis": "Проанализируйте влияние скидок на продажи.",
      "advanced_payment_method_preference": "Проанализируйте использование способов оплаты и статистику транзакций.",
      "advanced_stock_alert_system": "Создайте систему оповещения о запасах с категориями статусов.",
      "advanced_cte_window_customer_ranking": "Ранжируйте клиентов по расходам, используя CTE и оконные функции.",
      "advanced_sales_growth_rate": "Рассчитайте темп роста продаж месяц к месяцу.",
      "advanced_product_cohort_analysis": "Выполните когортный анализ удержания клиентов.",
      "sql3_rollup_sales_hierarchy": "Рассчитайте иерархические итоги продаж по странам и городам с помощью ROLLUP.",
      "sql3_cube_multi_dimensional": "Создайте многомерный анализ продаж по уровням лояльности и годам с помощью CUBE.",
      "sql3_grouping_sets_flexible": "Создайте гибкие группировки для анализа продаж с помощью GROUPING SETS.",
      "sql3_ntile_quartiles": "Сегментируйте клиентов по квартилям расходов с помощью NTILE.",
      "sql3_first_last_value": "Найдите самый длинный и короткий трек в каждом альбоме с FIRST_VALUE и LAST_VALUE.",
      "sql3_nth_value": "Получите третий по размеру трек с помощью NTH_VALUE.",
      "sql3_percent_rank": "Рассчитайте процентильный ранг клиентов по расходам с PERCENT_RANK.",
      "sql3_cume_dist": "Вычислите кумулятивное распределение длительности треков с CUME_DIST.",
      "sql3_lateral_join": "Найдите клиентов с недавними заказами с помощью LATERAL join.",
      "sql3_window_range_preceding": "Рассчитайте скользящее среднее за 7 дней для сумм заказов.",
      "sql3_pivot_simulation": "Сводите месячные продажи по столбцам месяцев с CASE.",
      "sql3_recursive_numbers": "Создайте последовательность чисел с квадратами и кубами через рекурсивный CTE.",
      "sql3_recursive_date_series": "Создайте серию дат для января 2024 с днями недели через рекурсивный CTE.",
      "sql3_moving_aggregate": "Рассчитайте накопительный итог и скользящее среднее за 30 дней.",
      "sql3_dense_rank_gaps": "Сравните поведение RANK и DENSE_RANK для размеров треков.",
      "sql3_window_filter_qualify": "Найдите топ-5 клиентов в каждом уровне лояльности по расходам.",
      "sql3_lag_lead_comparison": "Сравните суммы заказов клиентов с предыдущими и следующими с LAG и LEAD.",
      "sql3_percentile_cont": "Рассчитайте медиану, Q1 и Q3 длительности треков с PERCENTILE_CONT.",
      "sql3_window_frame_groups": "Агрегируйте продажи с использованием GROUPS в оконных функциях.",
      "sql3_advanced_running_difference": "Рассчитайте ежедневные изменения выручки и процентные темпы роста.",
      "dw_simple_star_schema_join": "Рассчитайте месячную выручку из таблиц фактов и измерений хранилища данных.",
      "dw_product_category_sales": "Проанализируйте продажи по категориям продуктов из размерной модели.",
      "dw_customer_lifetime_value": "Рассчитайте пожизненную ценность клиентов и количество покупок.",
      "dw_profitability_analysis": "Проанализируйте прибыльность категорий продуктов с маржой.",
      "dw_time_series_daily_sales": "Выполните временной анализ ежедневных продаж со скользящими средними.",
      "dw_seasonal_analysis": "Проанализируйте сезонные паттерны продаж по кварталам и месяцам.",
      "dw_customer_segmentation": "Сегментируйте клиентов по ценностным уровням с NTILE для RFM-анализа.",
      "dw_year_over_year_growth": "Рассчитайте темпы роста выручки год к году.",
      "dw_top_products_per_category": "Найдите топ-3 продукта в каждой категории по выручке с ранжированием.",
      "dw_customer_retention_cohort": "Выполните когортный анализ удержания клиентов с даты первой покупки.",
      "dw_abc_analysis": "Классифицируйте продукты по ABC-категориям на основе вклада в выручку.",
      "dw_basket_analysis": "Рассчитайте средний размер и стоимость корзины для анализа транзакций.",
      "dw_customer_rfm_analysis": "Выполните RFM-сегментацию (давность, частота, стоимость) для анализа клиентов.",
      "dw_slowly_changing_dimension": "Запросите медленно изменяющееся измерение (SCD Type 2) для исторических данных клиентов.",
      "dw_kpi_dashboard": "Рассчитайте ключевые показатели эффективности (KPI) для бизнес-панели.",
      "dw_geographic_performance": "Проанализируйте географическую эффективность продаж по странам и регионам."
    },
    "ai_feedback_title": "Педагогическая обратная связь ИИ",
    "ai_feedback_loading": "Gemini AI анализирует ваш запрос...",
    "ai_feedback_error": "Не удалось загрузить обратную связь ИИ. Пожалуйста, попробуйте позже.",
    "ai_feedback_hints": "Подсказки для улучшения запроса",
    "ai_feedback_concepts": "Концепции для повторения"
  }
}